app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
    if params[:method] == 'delete'
      @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 9]]

  def create
    @task = Task.new(task_params)
    @task.save
---
INSERT INTO "tasks" ("title", "details", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "details" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["details", "Do not mix colors, ok"], ["updated_at", "2023-11-24 14:59:53.069723"], ["id", 1]]